app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2)
---
  def find_user
    @user = User.find(params[:id])